//Написать программу, которая вводит ряд строк текста и выводит те из них, которые начинаются с буквы «b».
#include <iostream>
#include <string>
using namespace std;

int main() {
    setlocale(LC_ALL, "RUS");
    // Объявляем переменную, в которую будет вводиться строка
    string str;

    cout << "Введите ряд строк:" << endl;

    // Цикл будет продолжаться до тех пор, пока пользователь не введет пустую строку
    while (getline(cin, str)) {
        // Проверяем, начинается ли строка с буквы "b"
        if (str[0] == 'b') {
            cout << str << endl;
        }
    }
    return 0;
}