// Написать программу, которая вводит несколько слов текста и определяет общее количество слов. Слова разделены пробелами.
#include <iostream> 
#include <string> 

using namespace std;

int main()
{
    setlocale(LC_ALL, "RUS");
    // Объявление переменной для хранения вводимого текста 
    string text;

    // Запрос на ввод текста 
    cout << "Введите текст: ";
    getline(cin, text);

    // Объявление переменной для хранения общего количества слов
    int count = 0;

    // Перебор всех символов текста 
    for (int i = 0; i < text.length(); i++) {

        // Если символ является пробелом, то количество слов увеличивается на единицу 
        if (text[i] == ' ')
            count++;
    }

    // Вывод результата 
    cout << "Общее количество слов: " << count + 1 << endl;

    return 0;
}